Revit 2015 API
FamilyInstance.HostParameter Property
If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public double HostParameter { get; }
Visual Basic
Public ReadOnly Property HostParameter As Double
	Get
Visual C++
public:
property double HostParameter {
	double get ();
}
Remarks
This works for instances with a host element that is of type Wall or is in the OST_Walls category only, including in-place ones.
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace